In [1]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats

# Hypothesis Testing Exercise - 01 Cutlets

In [2]:
cutlets_df = pd.read_csv('F:\\PYTHON\\DATA SCIENCE\\Hypothesis Testing\\Assignment\\Cutlets.csv')

In [3]:
cutlets_df

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [4]:
# H0 = mean(unit 1) = mean(unit 2)
# H1 = mean(unit 1) != mean (unit 2)

In [5]:
# Two sample two tail t - test to check for conditions

In [6]:
scipy.stats.ttest_ind(cutlets_df['Unit A'],cutlets_df['Unit B'])

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [7]:
# As P-value > .05 , We will keep null hypotehsis

In [8]:
# There is no significant differnce in the diameter of the cutlet between two units.

# Hypothesis Testing Exercise - 02 Lab TAT

In [9]:
lab_df = pd.read_csv('F:\\PYTHON\\DATA SCIENCE\\Hypothesis Testing\\Assignment\\LabTAT.csv')

In [10]:
lab_df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [11]:
lab_df.shape

(120, 4)

In [12]:
lab_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.8 KB

In [13]:
# H0 = mean(Lab 1) = mean(Lab 2) = mean(Lab 3) = mean(Lab 4)
# H1 =   mean(Lab 1) != mean(Lab 2) = mean(Lab 3) = mean(Lab 4)
       # mean(Lab 1) = mean(Lab 2) != mean(Lab 3) = mean(Lab 4)
       # mean(Lab 1) = mean(Lab 2) = mean(Lab 3) != mean(Lab 4)  
       # mean(Lab 1) != mean(Lab 2) != mean(Lab 3) = mean(Lab 4)
       # mean(Lab 1) = mean(Lab 2) != mean(Lab 3) != mean(Lab 4)
       # mean(Lab 1) != mean(Lab 2) = mean(Lab 3) != mean(Lab 4)
       # mean(Lab 1) != mean(Lab 2) != mean(Lab 3) != mean(Lab 4)

In [14]:
# ANOVA test to compare TAT of 4 different lab

In [15]:
scipy.stats.f_oneway(lab_df['Laboratory 1'],lab_df['Laboratory 2'],lab_df['Laboratory 3'],lab_df['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [16]:
# H0 is < .05 , we will go with H1
# TAT of reports of 4 Labs are not Similar

In [17]:
# Tukey test to compare mean of each Labs

In [18]:
data = pd.melt(lab_df.reset_index() , id_vars=['index'] ,value_vars= ['Laboratory 1','Laboratory 2','Laboratory 3','Laboratory 4'])
data.columns = ['index' ,'labs' , 'values']

In [19]:
data

     index          labs  values
0        0  Laboratory 1  185.35
1        1  Laboratory 1  170.49
2        2  Laboratory 1  192.77
3        3  Laboratory 1  177.33
4        4  Laboratory 1  193.41
..     ...           ...     ...
475    115  Laboratory 4  172.68
476    116  Laboratory 4  177.64
477    117  Laboratory 4  170.27
478    118  Laboratory 4  150.87
479    119  Laboratory 4  162.21

[480 rows x 3 columns]

In [20]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd
from statsmodels.stats.multicomp import MultiComparison

In [21]:
mc = MultiComparison(data['values'] , data['labs'])

In [22]:
mcresult = mc.tukeyhsd(.05)
mcresult.summary()

In [23]:
# From Tukey test only mean(Lab 1) = mean(Lab 2) , all other pairs means are different from each other.

# Hypothesis Testing Exercise - 03 Buyer Ratio

In [24]:
buyer_df = pd.read_csv('F:\\PYTHON\\DATA SCIENCE\\Hypothesis Testing\\Assignment\\BuyerRatio.csv')

In [25]:
buyer_df

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [26]:
# Chi Square Test

In [27]:
# H0 = Praportions are equal accross regions
# H1 = Praportions are not eqaul accross regions

In [28]:
data = np.array([[50,142,131,70],[435,1523,1356,750]])

In [29]:
from scipy import stats

In [30]:
stats.chi2_contingency(data)

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [31]:
# P value = .66 , ie > .05 , We take null hypothesis
# Praportions are equal accross all regions.

# Hypothesis Testing Exercise - 04 Customer Order Form

In [32]:
customer_df = pd.read_csv('F:\\PYTHON\\DATA SCIENCE\\Hypothesis Testing\\Assignment\\Costomer+OrderForm.csv')

In [33]:
customer_df

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [34]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 4.8+ KB

In [35]:
a = pd.DataFrame(customer_df.Phillippines.value_counts())
b = pd.DataFrame(customer_df.Indonesia.value_counts())
c = pd.DataFrame(customer_df.Malta.value_counts())
d = pd.DataFrame(customer_df.India.value_counts())

In [36]:
pd.concat([a,b,c,d],axis=1)
# Creating table to check defect percentage accross centers

            Phillippines  Indonesia  Malta  India
Error Free           271        267    269    280
Defective             29         33     31     20

In [37]:
# H0 : Defect percentage accross centers are equal
# H1 : Defect percentage accross centers are not equal

In [38]:
# Chi Square Test

In [39]:
customer_data = np.array([[271,267,269,280],[29,33,31,20]])

In [40]:
scipy.stats.chi2_contingency(customer_data)

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[271.75, 271.75, 271.75, 271.75],
        [ 28.25,  28.25,  28.25,  28.25]]))

In [41]:
# P value for H0 is .277 which  is greater than .05 , We accept null hypothesis 
# Defect percentage accross centers are same